HasViewDiscipline Method
 Indicates if the view has a Discipline property
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public bool HasViewDiscipline()
  Visual Basic
Public Function HasViewDiscipline As Boolean
  Visual C++
public:
bool HasViewDiscipline()
 Return Value
 True if the view has a Discipline property
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →